# PtPerpCircle

## Description
Returns a point on the circle which is closest to the input point.

```pascal
FUNCTION PtPerpCircle(
				pt     : VECTOR;
				cenPt  : VECTOR;
				radius : REAL): VECTOR;
```

```python
def vs.PtPerpCircle(pt, cenPt, radius):
    return VECTOR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt|VECTOR|   |
|cenPt|VECTOR|   |
|radius|REAL|   |

## Version
Availability: from Vectorworks 2014

## Category
* Graphic Calculation